
{
  "status": "success",
  "totalResults": 5111,
  "results": [
    {
      "title": "What India Should Have Done for Migrant Workers – But Conveniently Didn't",
      "link": "https://thewire.in/labour/migrant-workers-daily-wage-covid",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Armed with multitudes of national surveys, the fact that it is a leader in IT applications and the richness of subject expertise in the country, India needs to do better than what it has since 2020.",
      "content": "In response to a question, the Ministry of Labour and Employment recently informed the Lok Sabha that as per the National Crime Records Bureau data, daily wage earners constituted the largest proportion, one-fourth, of those who died by suicide in India between 2019 and 2021, as reported in The Wire . From 32,563 in 2019, the number of deaths by suicides by daily wage earners increased to 37,666 in 2020, the year of COVID-19 and the national lockdown. The rise in number continued to reach 42,004 in 2021. People, especially daily wage earners and migrants, are thus reeling from the post-COVID-19 impact as well. Migrants walking during the lockdown was the defining image of the first wave of COVID-19. Millions of migrants abandoned their temporary residences and belongings, along with their hopes and promises of a better future in an alien place, and started walking for their homes as a lockdown was announced with four hours’ notice. Some walked hundreds of miles, some even thousands of miles. Braving the elements of nature, old, ill, pregnant and able-bodied people walked, along with their children, carrying whatever they could carry with them. Hundreds of them perished during this journey. Those lucky ones who were able to reach their homes alive suffered police batons , and the indignities of travelling like animals, often being fleeced by the transporters. Also read: Is the E-Shram Portal Really Providing Benefits to Workers or Merely Creating a National Database? One often hears India is a country of migrants but how many migrants exactly, no one knows, not even the government nor the experts. That they live in precarious conditions without much of a health and social support system was apparently not known to the people in power who announced lockdowns. Did they also not know that a significant number of them are daily wage earners and can eat and survive only if they earn every day? Migrants’ families comprise old people, women and children, some of whom require food, milk and medicines on a regular basis. In most cases, their landlords and employers did not take care of them. Migrants walking to board a train to Jharkhand from Central Railway Station, in Chennai, May 13, 2020. Photo: PTI/R. Senthil Kumar Migrants’ trials at this time was an opportunity for policymakers to learn about migration and migrants and make policies and programmes for their wellbeing. But now it is safe to say that we as a society and country did not learn any lessons. The cut in MGNREGA allocation in this year’s Union Budget and the lack of any significant measure for migrant labourers point in the same direction. We missed an opportunity to strengthen our data and information systems to have an accurate picture of the migration scenario in the country and states. Census 2011 says there were 450 million internal migrants in India at that time. The Economic Survey of 2017 says that there are 60 million inter-state migrants, with an average national flow of only 9 million. The National Migrant Information System, a portal launched to capture the information of migrants travelling on special Shramik Trains from May 1 to June 3, 2020 and the Ministry of Railways reported that more than 6 million migrants travelled by trains. Another 4 million traveled in buses. Migration tables from the Census 2011 were released only in 2019, eight years after the Census. This paints a sorry state of affairs as far as migration statistics including numbers, demography, migration routes, etc. are concerned. With a rich history of the Census (which is now delayed ), multitudes of national surveys, the fact that India is a leader in IT applications and considering the richness of subject expertise in the country, it needs to do better than this. Migrants moving on foot should have been a big wake-up call for all, and appropriate systems should have been put in place for real-time migrant data capturing and sharing for policy development and programme planning. The second lesson to be learned should have been what made these migrants flee the destination cities and places. The status of their health and well-being as well as living and working conditions should have been at the top of the to-do list of the policymakers. Appealing to the good side of employers and landlords to take care of migrants, ad-hoc and delayed provision of transportation to reach home with migrants paying from their own pockets, and providing ration and one-time cash transfers are not sustainable and effective policy and programmatic interventions. Most migrants work in the informal sector, with no health and social security provisions. Their wages are not standardized and secure. Lack of affordable housing means they are forced to live in urban villages or slums. The lack of portability of state-specific benefits into another state renders them further vulnerable. It is important to mention that migration will gain further momentum in days to come because of differential demographic transitions and unequal economic development and employment opportunities across states. As per the population projections by National Commission on Population, 55%, 17 crores out of the total 31.1 crores population growth in India during 2011-2036, will occur in the five states of Bihar, Uttar Pradesh Maharashtra, West Bengal and Madhya Pradesh – all high out-migrating states. The north-central region will have a surplus young working-age population while the greying south will require young hands to keep its institutions running, maintain economic productivity and for taking care of the elderly while. There are already well-established migration routes between these regions. Demographic divergence will render further impetus to the migration. Kerala, for example, is already witnessing an increased in-migration. Migrant workers walking in Mamallapuram, May 31, 2020. Photo: PTI/File The question to ask is: are we proactively planning for such a scenario? The Working Group on Migration (2017) set up by the Ministry of Urban Housing and Poverty alleviation examined the status of migrant workers in the country and submitted its report to the government in 2017. Action on the report is still awaited. Migration could be a big game changer and a win-win situation for individuals, families, states (both sending and receiving) and the nation if collaborative planning is done by migration origin and destination states with the facilitation of the Union government. There is a need to gain a deeper understanding of migration flows so that estimations and projections can be made regarding changing need for housing and infrastructure, health care and utilities, education and skills. States need to work together to provide portability of identity proof and entitlements, as well as build support systems for families left behind. India urgently needs to take cognisance of the divergent demographic transition trends. Timely strategic action can develop human capacities to cater to future needs and build rights-based policies that work for migrants as well as locals. NITI Aayog should take the lead in this direction and constitute a High-Level Task Force to develop a white paper outlining current and future situations, policy regimes and mechanisms. The second step, based on the white paper, should be to set up a separate ministry or independent department for migrants with its own mandate, manpower and resources. Devender Singh worked with the United Nations Population Fund (UNFPA) from 2015-2021. Currently, he is a visiting Senior Fellow with the Impact and Policy Research Institute (IMPRI), Delhi. Debasish Chowdhury is with Medicine Sans Frontiers (MSF). Edited by Soumashree Sarkar.",
      "pubDate": "2023-02-17 06:18:50",
      "image_url": null,
      "source_id": "thewire",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "BCCI Chief Selector Chetan Sharma resigns after damming sting operation: Details",
      "link": "https://www.opindia.com/2023/02/bcci-chetan-sharma-resigns-zee-news-sting-operation/",
      "keywords": [
        "News Reports",
        "Sports",
        "BCCI",
        "Chetan Sharma",
        "Cricket",
        "Sting operation"
      ],
      "creator": [
        "OpIndia Staff"
      ],
      "video_url": null,
      "description": "The development comes three days after Chetan Sharma was caught making damming revelations in a Zee News sting operation.",
      "content": "OpIndia bringing the \\'right\\' side of India OpIndia bringing the \\'right\\' side of India Friday, February 17, 2023 Latest News About Us Contact Us Write for Us MyVoice Facebook Instagram RSS Twitter Youtube OpIndia bringing the \\'right\\' side of India Politics Hindus called rioters despite a Hindu being attacked first by Muslims, stones pelted from mosque: How Muslims are playing victim after Palamu violence Arvind Kejriwal gloats that Delhi is not among top 10 most polluted cities in the world, here is how he is misleading and cherrypicking... ‘I am taking Tipu sultan’s name, do whatever you can’, says Asaduddin Owaisi Life Mission scam in Kerala: ‘CM Vijayan’s entire family is involved’, says Swapna Suresh after ED arrests former principal secretary Sivasankar ‘Ardent followers of Tipu sultan should not live’: Karnataka BJP president Nalin Kumar Kateel Opinions Judiciary bends, yet again, in fear of the Muslim street veto should they get offended: Here is how How Islamists are furthering their agenda of turning Bangladesh into a Hindu-hating nation Burning of Quran, Ramcharitmanas, vilification of Baba Bageshwar and silence on pastor Bajinder: How it’s Abrahamic supremacy at play Why is Congress using Adani for ‘corruption charge’ against Modi, after massive failure of ‘Rafale scam’? Understanding how a Congressi mind works How Bangladesh, with the active help of the Biden admin, is heading towards chaos with a greater risk of Islamist attacks against Hindus Fact-Check All Media Fact-Check Political Fact-Check Social Media Fact-Check Congressis posting their Ls: Manish Tewari tries to poke holes in historic Air India deal, here is how he is wrong BRS leader peddles fake news about Bengaluru-Mysuru Expressway, falsely claims 4 lanes have been reduced due to corruption Madhya Pradesh government clarifies that there is no ban on tandoor, calls media reports baseless Reports suggest Pakistan denied airspace to Indian military aircraft used for sending aid to Turkey, here is what we know Media Wall Street Journal suggests Americans to skip breakfast to save money, gets mocked US State Department ignores Pakistani journalist’s question on Income Tax survey on BBC The Wire editor Seema Chishti sends notice to Organiser editor, Vijay Patel and Twitter for alleging links with anti-Adani campaign BBC raids: A look into the broadcaster’s long track record of tax avoidance and unscrupulous financial practices in the UK Income Tax Dept survey in BBC office in India enters second day Variety All Books Culture and History Satire WTF News Ujjain prepares for grand Mahashivratri celebration, 21 lakh Diyas to be lit on the ghats of Shipra river Entry to Taj Mahal to be free for three days to mark 368th death anniversary of Shah Jahan Who is Chahat Fateh Ali Khan? The latest viral sensation from Pakistan makes Taher Shah look like (mankind) angel 108 South Korean saints start Dhamma Yatra from Sarnath Specials All Interviews OpIndia Explains OpIndia Scoops Are things really ‘aaall well’ in Ladakh? A closer look at ‘climate fast’ by Sonam Wangchuk and criticism of his projects by locals Kerala govt, once against Adani taking over airport operations in the state capital, raises Rs 400 crore for Adani Ports under Vizhinjam agreement: Details Leicester violence, propaganda against PM Modi and dual face of BBC: Pt Satish Sharma explains why British Hindus are saying ‘enough is enough’ ISRO successfully launches SSLV-D2 placing EOS-07 and two other satellites in orbit: Here is all you need to know More… Social Media Entertainment Political History of India Government and Policy Economy and Finance Sports World Crime Law Support Us हिन्दी में ગુજરાતીમાં Search OpIndia bringing the \\'right\\' side of India Politics News Reports Hindus called rioters despite a Hindu being attacked first by Muslims, stones pelted from mosque: How Muslims are playing victim after Palamu violence News Reports Arvind Kejriwal gloats that Delhi is not among top 10 most polluted cities in the world, here is how he is misleading and cherrypicking... Politics ‘I am taking Tipu sultan’s name, do whatever you can’, says Asaduddin Owaisi News Reports Life Mission scam in Kerala: ‘CM Vijayan’s entire family is involved’, says Swapna Suresh after ED arrests former principal secretary Sivasankar News Reports ‘Ardent followers of Tipu sultan should not live’: Karnataka BJP president Nalin Kumar Kateel Opinions Opinions Judiciary bends, yet again, in fear of the Muslim street veto should they get offended: Here is how Opinions How Islamists are furthering their agenda of turning Bangladesh into a Hindu-hating nation Opinions Burning of Quran, Ramcharitmanas, vilification of Baba Bageshwar and silence on pastor Bajinder: How it’s Abrahamic supremacy at play Politics Why is Congress using Adani for ‘corruption charge’ against Modi, after massive failure of ‘Rafale scam’? Understanding how a Congressi mind works Opinions How Bangladesh, with the active help of the Biden admin, is heading towards chaos with a greater risk of Islamist attacks against Hindus Fact-Check All Media Fact-Check Political Fact-Check Social Media Fact-Check News Reports Congressis posting their Ls: Manish Tewari tries to poke holes in historic Air India deal, here is how he is wrong News Reports BRS leader peddles fake news about Bengaluru-Mysuru Expressway, falsely claims 4 lanes have been reduced due to corruption News Reports Madhya Pradesh government clarifies that there is no ban on tandoor, calls media reports baseless News Reports Reports suggest Pakistan denied airspace to Indian military aircraft used for sending aid to Turkey, here is what we know Media News Reports Wall Street Journal suggests Americans to skip breakfast to save money, gets mocked News Reports US State Department ignores Pakistani journalist’s question on Income Tax survey on BBC News Reports The Wire editor Seema Chishti sends notice to Organiser editor, Vijay Patel and Twitter for alleging links with anti-Adani campaign News Reports BBC raids: A look into the broadcaster’s long track record of tax avoidance and unscrupulous financial practices in the UK News Reports Income Tax Dept survey in BBC office in India enters second day Variety All Books Culture and History Satire WTF News News Reports Ujjain prepares for grand Mahashivratri celebration, 21 lakh Diyas to be lit on the ghats of Shipra river News Reports Entry to Taj Mahal to be free for three days to mark 368th death anniversary of Shah Jahan Entertainment Who is Chahat Fateh Ali Khan? The latest viral sensation from Pakistan makes Taher Shah look like (mankind) angel Culture and History 108 South Korean saints start Dhamma Yatra from Sarnath Specials All Interviews OpIndia Explains OpIndia Scoops News Reports Are things really ‘aaall well’ in Ladakh? A closer look at ‘climate fast’ by Sonam Wangchuk and criticism of his projects by locals OpIndia Explains Kerala govt, once against Adani taking over airport operations in the state capital, raises Rs 400 crore for Adani Ports under Vizhinjam agreement: Details Interviews Leicester violence, propaganda against PM Modi and dual face of BBC: Pt Satish Sharma explains why British Hindus are saying ‘enough is enough’ News Reports ISRO successfully launches SSLV-D2 placing EOS-07 and two other satellites in orbit: Here is all you need to know More… Social Media Entertainment Political History of India Government and Policy Economy and Finance Sports World Crime Law Support Us हिन्दी में ગુજરાતીમાં More Search Home News Reports BCCI Chief Selector Chetan Sharma resigns after damming sting operation: Details News Reports Sports Updated: 17 February, 2023 BCCI Chief Selector Chetan Sharma resigns after damming sting operation: Details The development comes three days after Chetan Sharma was caught making damming revelations in a Zee News sting operation. 17 February, 2023 OpIndia Staff Chetan Sharma, image via BCCI Facebook Twitter Telegram Email WhatsApp 6 On Friday (February 17), the Chief Selector of the Board of Control for Cricket in India (BCCI), Chetan Sharma, tendered his resignation from his post. As per news agency ANI , Sharma handed over the resignation letter to BCCI Secretary Jay Shah, who accepted the former’s decision to step down. The development comes three days after he was caught making damming revelations about top Indian players in a sting operation , conducted by Zee News . BCCI chief selector Chetan Sharma resigns from his post. He sent his resignation to BCCI Secretary Jay Shah who accepted it. (File Pic) pic.twitter.com/1BhoLiIbPc — ANI (@ANI) February 17, 2023 In the sting operation, Chetan Sharma alleged that Virat Kohli “lied” that the then BCCI president Sourav Ganguly did not attempt to discourage him from resigning as T20 captain. He claimed, “Any row between player and BCCI President is dangerous as it becomes players vs BCCI. Who is wrong is judged later, but it becomes an attack on BCCI directly. All players are warned that the harm from such things will come to players only.” Chetan Sharma added, “Virat Kohli felt he lost the captaincy because of BCCI President. There were 9 people in the selection committee video conference, Ganguly may have told him ‘think about it once’. I think Kohli didn’t hear it, there were 9 others there including myself and all other selectors.” While talking about players taking injections for fitness, Chetan Sharma claimed, “Indian Cricket Team players take injections & get 100% fit even if they’re 80% fit. These are not painkillers. These injections contain Drugs which aren’t caught in Dope Test.” He further added that some star players are given a green signal from the NCA even when they are not fully fit, and then it gets onto the selectors to make a final call on the selection. Support Us Whether NDTV or 'The Wire', they never have to worry about funds. In name of saving democracy, they get money from various sources. We need your support to fight them. Please contribute whatever you can afford Pay Searched terms Chetan Sharma resignation Topics BCCI Chetan Sharma Cricket Sting operation OpIndia Staff https://www.opindia.com Staff reporter at OpIndia Share on : Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Koo (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on Telegram (Opens in new window) Click to share on WhatsApp (Opens in new window) Related Articles Trending now News Reports Modi will have to answer in parliament: George Soros, who pledged $1B to take on ‘nationalists’ including PM Modi’, comments on Adani row OpIndia Staff - 17 February, 2023 George Soros also alleged that so-called anti-Muslim violence in India has spearheaded the 'meteoric rise' of Prime Minister Narendra Modi. News Reports Hindus called rioters despite a Hindu being attacked first by Muslims, stones pelted from mosque: How Muslims are playing victim after Palamu violence OpIndia Staff - 17 February, 2023 Muslim mob indulged in violence over the installation of welcome gates by Hindus ahead of Mahashivaratri in Palamu of Jharkhand. Family blast administration for calling the death of mother-daughter duo in Kanpur as ‘suicide’, here is how things have turned 16 February, 2023 Congressis posting their Ls: Manish Tewari tries to poke holes in historic Air India deal, here is how he is wrong 16 February, 2023 Judiciary bends, yet again, in fear of the Muslim street veto should they get offended: Here is how 16 February, 2023 Prithvi Shaw’s friend’s car attacked after cricketer refused to take selfie with fans, FIR registered 16 February, 2023 Recently Popular News Reports US State Department ignores Pakistani journalist’s question on Income Tax survey on BBC ANI - 16 February, 2023 News Reports Nikki Yadav was the niece of a Kargil War veteran, live-in partner Sahil strangled her with a data cable inside his car OpIndia Staff - 16 February, 2023 Entertainment Left-Wing ‘activist’ Swara Bhasker marries Samajwadi Party leader Fahad Ahmed OpIndia Staff - 16 February, 2023 News Reports Wall Street Journal suggests Americans to skip breakfast to save money, gets mocked OpIndia Staff - 16 February, 2023 Cricket India agar aankhein dikha raha hai…: Shahid Afridi responds to BCCI’s refusal to send Team India to Pakistan for Asia Cup OpIndia Staff - 16 February, 2023 News Reports Modi will have to answer in parliament: George Soros, who pledged $1B to take on ‘nationalists’ including PM Modi’, comments on Adani row OpIndia Staff - 17 February, 2023 - Advertisement - Latest News Islamic scholar says Swara Bhasker’s marriage to Fahad Ahmad is invalid as per Quran, slams ‘liberal Muslims’ who talk about Islam in India Shraddha - Ujjain prepares for grand Mahashivratri celebration, 21 lakh Diyas to be lit on the ghats of Shipra river ANI - Modi will have to answer in parliament: George Soros, who pledged $1B to take on ‘nationalists’ including PM Modi’, comments on Adani row OpIndia Staff - Hindus called rioters despite a Hindu being attacked first by Muslims, stones pelted from mosque: How Muslims are playing victim after Palamu violence OpIndia Staff - Israel-based disinformation team interfered with more than 30 elections around the world: Report OpIndia Staff - West Bengal: Rat crawl on a patient lying on the floor of Malda Medical College and Hospital, video goes viral OpIndia Staff - 12 more Cheetahs to be brought to India from South Africa, IAF’s C-17 Globemaster aircraft to land on 18 February carrying them OpIndia Staff - India agar aankhein dikha raha hai…: Shahid Afridi responds to BCCI’s refusal to send Team India to Pakistan for Asia Cup OpIndia Staff - Australia: Khalistanis threaten Kali Mata Mandir in Melbourne to cancel bhajan program because invited singer Kanhiya Mittal is ‘staunch Hindu’ OpIndia Staff - Family blast administration for calling the death of mother-daughter duo in Kanpur as ‘suicide’, here is how things have turned OpIndia Staff - Read all the latest news Connect with us 255,564 Fans Like 619,708 Followers Follow 28,700 Subscribers Subscribe Subscribe to our Newsletter Each morning, get an email to keep updated with all the news, opinions and analysis published by OpIndia. Enter your email address: Browse by months Browse by months Select Month February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 Contact: [email protected] About us News and opinion website that brings you reports and narrative from a perspective often ignored or suppressed by the mainstream media of India. Follow us Facebook Instagram RSS Twitter Youtube © OpIndia.com Latest News Hindi News MyVoice Terms Privacy Policy About Us Contact Us",
      "pubDate": "2023-02-17 06:15:33",
      "image_url": null,
      "source_id": "opindia",
      "category": [
        "sports"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Vaathi/Sir Movie OTT Streaming Platform and Release Date FIxed",
      "link": "https://www.thehansindia.com/cinema/vaathisir-movie-ott-streaming-platform-and-release-date-fixed-783421",
      "keywords": [
        "Entertainment"
      ],
      "creator": [
        "The Hans India"
      ],
      "video_url": null,
      "description": null,
      "content": "Vaathi , an upcoming Tamil-Telugu bilingual film directed by Venki Atluri and starring the versatile actor Dhanush , has been eagerly awaited by fans. Dhanush has earned critical acclaim for his performances in films such as Asuran, Polladhavan, Kodi, Karnan, and VIP, where he has played a wide range of memorable characters. Vaathi, which has been titled Sir in Telugu, was simultaneously shot in both languages. The movie's teaser trailer, released on Dhanush's birthday, has already generated excitement among fans. The film is set to hit theaters on February 17, 2023. While the film's theatrical release is highly anticipated, it has also been confirmed that Vaathi's digital and satellite rights have been acquired by Netflix . However, there is currently no reliable information available about the OTT release date. It is tentatively expected to be released on Netflix on April 17, 2023, after a 45-day theatrical run.",
      "pubDate": "2023-02-17 06:08:36",
      "image_url": "https://assets.thehansindia.com/h-upload/2023/02/17/500x300_1336642-1987585285vaathi-sir-dhanush-movie-jpeg640360.jpg",
      "source_id": "thehansindia",
      "category": [
        "entertainment"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Prithvi Shaw: 3 Biggest Controversies that Affected Shaw’s Career",
      "link": "https://krooknews.com/sports/cricket/prithvi-shaw-3-biggest-controversies-that-affected-shaws-career-2023021703/",
      "keywords": [
        "Cricket",
        "India",
        "News",
        "Sports"
      ],
      "creator": [
        "Shubham Mandal"
      ],
      "video_url": null,
      "description": "3 Biggest Controversies that Affected Shaw’s Career: Indian Cricketer Prithvi Shaw was marked as a special talent from his school cricket days. He had great skill and potential in his cricketing career. Shawa started his test cricket career with a century on his Debut in Oct 2018. Unfortunately, he could not able to place in […] The post Prithvi Shaw: 3 Biggest Controversies that Affected Shaw’s Career appeared first on KrookNews: Latest News, Sports News, Technology News, Gaming News.",
      "content": "3 Biggest Controversies that Affected Shaw’s Career: Indian Cricketer Prithvi Shaw was marked as a special talent from his school cricket days. He had great skill and potential in his cricketing career. Shawa started his test cricket career with a century on his Debut in Oct 2018. Unfortunately, he could not able to place in the national team in any format. He has been involved in several controversies since 2019. Read More | Prithvi Shaw Case: Why Sapna Gill attacked Prithvi Shaw’s car 3 Biggest Controversies Selfie controversy: Shaw had just left for dinner at a five-star hotel in Santacruz when the unnamed suspect arrived and insisted on taking a selfie. He took a selfie as a courtesy to the two, but the same group later returned and demanded additional selfies. He declined, stating that he had come to the restaurant with companions before his friend complained about them to the hotel management over the phone. Ali Kashif said “Sapna was assaulted by Prithvi. A stick was seen in Prithvi’s hand. Prithvi’s friends assaulted the group first. Sapna is currently at Oshiwara police station. The police are not allowing her to go for medical.” Cough syrup controversy: The 23-year-old’s urine sample was collected as part of the BCCI’s anti-doping testing procedure on February 22, 2019, in Indore, during the Syed Mushtaq Ali Trophy match. Terbutaline was discovered in the material after it was examined. Prithvi Shaw Attacked In Mumbai By Some Drunk People. This Video Is Very Scary. Fans Need To Understand They Can't Misbehave With Any Celebrity. Prithvi Somehow Managed To Grab Baseball Bat From That Lady. This Lady Attacked Prithvi Shaw Car With Baseball Bat. pic.twitter.com/thtyECpE1w — Vaibhav Bhola 🇮🇳 (@VibhuBhola) February 16, 2023 This specific chemical is included on WADA’s Banned List of Substances as being illegal both in and out of competition. Due to a doping offense during the 2018–19 season, he was placed on suspension until November 15, 2019. He allegedly accidentally consumed a prohibited drug found in cough syrups, which caused him to miss the first part of the Indian cricket season. The BCCI proposed an eight-month suspension that was retroactively dated in light of the results. Failing the Yo-Yo Test: Prior to the Indian Premier League (IPL) 2022, Prithvi Shaw, Team India’s unpopular opener, failed the Yo-Yo test at the National Cricket Academy (NCA) in Bengaluru, according to PTI. Read More | Prithvi Shaw Case: Sapna Gill Claims Cricketer Was Drunk and Hit Her with a Bat The Yo-Yo test is required for all centrally contracted players before the IPL, regardless of whether they are injured or not. Shaw, who was kept on by Delhi Capitals prior to the IPL 2022 auction, was visiting the NCA to give an update on his health status even though he is not a player under a central contract. (With input from SportsKeeda )",
      "pubDate": "2023-02-17 05:57:12",
      "image_url": null,
      "source_id": "krooknews",
      "category": [
        "sports"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter",
      "link": "https://www.informalnewz.com/amrapali-dubey-became-pregnant-fans-were-shocked-to-see-the-viral-photo-know-what-is-the-matter/",
      "keywords": [
        "Entertainment",
        "Actors like Ritesh",
        "Amrapali Dubey",
        "Amrapali Dubey pregnant",
        "Daag Ego Lanchan"
      ],
      "creator": [
        "Shyamu Maurya"
      ],
      "video_url": null,
      "description": "Some photos of Amrapali Dubey are going viral on social media. Her fans are surprised to see these photos. Amrapali Dubey, the famous actress of Bhojpuri cinema, remains in headlines on social media for one reason or the other. At the same time, recently some pictures and videos of Amrapali Dubey are going viral on […] The post Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter first appeared on informalnewz.",
      "content": "Friday, February 17, 2023 Facebook Instagram Twitter Youtube Education Entertainment Finance Fuel Price Gold Rate today Hindi Jobs Alert Latest Cricket News Sports Technology More Search Home Entertainment Amrapali Dubey became pregnant, fans were shocked to see the viral photo,... Entertainment Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter By Shyamu Maurya February 17, 2023 0 75 Share Facebook Twitter Pinterest WhatsApp Telegram Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter Some photos of Amrapali Dubey are going viral on social media. Her fans are surprised to see these photos. Amrapali Dubey, the famous actress of Bhojpuri cinema, remains in headlines on social media for one reason or the other. At the same time, recently some pictures and videos of Amrapali Dubey are going viral on the internet, seeing which the fans are surprised. Amrapali Dubey is seen pregnant in these photos. There are tremendous discussions on social media regarding Amrapali Dubey Pregnant look. However, the matter is different. These are pictures and videos related to a film, in which Ritesh Pandey is also there. Some pictures of Amrapali Dubey are going viral on social media, in which she is looking beautiful in a black dress and in these photos she is seen flaunting her baby bump. Seeing the photos, people are also confused because Amrapali is laughing in some pictures and crying in others. If you are also confused, then tell that this is one of Amrapali’s look from her upcoming film, which is going viral on social media. The name of this upcoming film of Amrapali is ‘Daag Ego Lanchan’. Actors like Ritesh Pandey, Vikrant Singh Rajpoot are going to appear in this film along with Amrapali. The story of this film is about a pregnant woman, on whom her husband suspects. The husband suspects that Amrapali is having an affair with her brother-in-law. Because of this doubt, problems arise between husband and wife. People have liked this trailer a lot and that is why the trailer has got tremendous views. Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will start Tags Actors like Ritesh Amrapali Dubey Amrapali Dubey pregnant Daag Ego Lanchan Share Facebook Twitter Pinterest WhatsApp Telegram Previous article Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos Next article There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ Shyamu Maurya Shyamu has done Degree in Fine Arts and has knowledge about bollywood industry. He started writing in 2018. Since then he has been associated with Informalnewz. In case of any complain or feedback, please contact me @informalnewz.com RELATED ARTICLES Entertainment There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Entertainment Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos February 17, 2023 Entertainment Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 - Advertisment - Most Popular There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos February 17, 2023 Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin February 17, 2023 Load more Recent Comments Gul Mohiudin on Kavita sister-in-law wore a sari without a blouse, seeing the pictures you will also be… Venkatesh on Urfi Javed crossed all limits, wore a front open hoodie top without inner, see photos and videos Gul Mohiudin on Malaika Arora came out in a backless strappy dress late at night, someone had to handle the gown and someone held her hand Gul Mohiudin on Priyanka Chopra reached award function without bra, shame had to be saved repeatedly in open jacket Venkatesh on Disha Patani shared a bo*ld picture while taking a bath, seeing Tiger Shroff’s heart beat will increase EDITOR PICKS There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos February 17, 2023 Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 POPULAR POSTS There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos February 17, 2023 Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 POPULAR CATEGORY Entertainment 15456 Finance 9178 News 3653 India 1148 Technology 1097 Travel 616 Jobs Alert 491 Education 428 ABOUT US INFORMALNEWZ brings the Latest News & Top Breaking headlines on Politics and Current Affairs. Up-to-date news coverage, aggregated from sources all over the world by informal Newz. Find latest news coverage of breaking news events, trending topics, and compelling articles. Contact us: informalnewz@gmail.com FOLLOW US Facebook Instagram Twitter Youtube © informalnewz.com 2022 Izon web Pvt. Ltd. All Rights Reserved. Home Privacy Policy Authors and Team About Us Contact US Cookie Policy Disclaimer DNPA Code of Ethics Onwership and Funding Terms of Service",
      "pubDate": "2023-02-17 05:54:02",
      "image_url": null,
      "source_id": "informalnewz",
      "category": [
        "entertainment"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Congress Demands Probe Into Whether 'Team Jorge' Operates in India",
      "link": "https://thewire.in/politics/congress-demands-probe-into-whether-team-gorge-operates-in-india",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "\"If the government is not doing anything on this, it means it is seeking help to interfere in the country's democracy and elections. The data of Indians is being compromised by handing it over to a foreign firm,\" Supriya Shrinate said.",
      "content": "New Delhi: The Congress on Thursday (February 16) demanded a probe into the possible use of an Israeli firm’s services to interfere in Indian elections and spread disinformation. A recent report by a collaboration of international publications aided by Paris-based Forbidden Stories, published in The Guardian , said that elections around the world have been linked with an Israeli software to operate fake social media campaigns across several countries, including India. However, details of what the investigation has found on Indian have not yet been revealed. – फेक न्यूज – फर्जी अकाउंट्स – हैकिंग ये कुछ ऐसे साइबर हथियार हैं जिनका इस्तेमाल कर इजरायल के साइबर माफिया भारत में चुनाव के नतीजों को प्रभावित करते हैं। ऐसे में सवाल पूछना जरूरी है कि भारत में इनकी मदद कौन ले रहा है? वैसे इसका जवाब पूरा देश जानता है। pic.twitter.com/OQxglWAGoe — Congress (@INCIndia) February 16, 2023 Congress spokespersons Pawan Khera and Supriya Shrinate held a press conference where they compared ‘Team Jorge’, which the Israeli team of contractors allegedly running this operation, with the Bharatiya Janata Party’s IT Cell. Team Jorge allegedly sold hacking services and access to a vast army of fake social media profiles to influence opinion on Twitter, LinkedIn, Facebook, Telegram, Gmail, Instagram and YouTube. “We have seen a pattern in India. We want the government to break its silence and say what has been its contribution in saving democracy in the country,” Shrinate said, according to The New Indian Express . “This impacts India’s electoral process directly and there should be a probe.” Shrinate is also the head of the Congress’s social media team. “If the government is not doing anything on this, it means it is seeking help to interfere in the country’s democracy and elections. The data of Indians is being compromised by handing it over to a foreign firm,” she continued. “We would like to ask if the government intends to carry out an investigation in this matter. Will there be a Supreme Court monitored probe?” Shrinate said, according to India Today . Khera alleged that India’s democracy is being “hijacked” by the country’s ruling party. “An Israeli agency’s help is being taken to influence the country’s democracy. Sitting in India, they are conspiring against India’s democracy along with other countries,” he said. Khera added that this was not the first time the Narendra Modi government had been accused of using foreign companies or technology to undermine democracy, such as with the Pegasus allegations or during the Cambridge Analytica revelations. “Is there a link between Post Card News and Team Jorge – a team of Israeli contractors who claim to have manipulated more than 30 elections around the world using hacking, sabotage and automated disinformation on social media?” he asked. “The pattern of disinformation and fake news campaigns being adopted by the Israelis is mirrored by the ruling BJP very distinctly,” he continued. The Congress leaders also brought up specific instances of politically relevant disinformation being spread in India. “Is it not a fact that the BJP used fake news to repeatedly target the Bharat Jodo Yatra in the last four-five months and was always caught? Will the Modi government investigate the latest scandal that has hit the Indian political spectrum, involving yet again foreign contractors indulging in sophisticated hacking, sabotage and automated disinformation on social media?” Khera asked. ‘Team Jorge’, according to the investigation, is led by former Israeli special forces operative Tal Hanan. It was uncovered by three reporters – Gur Megiddo of TheMarker , Frederic Metezeau of Radio France and Omer Benjakob of Haaretz – who went undercover for six months. They posed as businessmen wanting to play role in an upcoming election in an African country.",
      "pubDate": "2023-02-17 05:48:34",
      "image_url": null,
      "source_id": "thewire",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Prediction for Shehzada's Box Office Day 1: Kartik Aaryan and Kriti Sanon's film is predicted to have a slow start, with a collection of only Rs 6 crore.",
      "link": "https://www.thehansindia.com/cinema/bollywood/prediction-for-shehzadas-box-office-day-1-kartik-aaryan-and-kriti-sanons-film-is-predicted-to-have-a-slow-start-with-a-collection-of-only-rs-6-crore-783414",
      "keywords": [
        "Entertainment,Bollywood"
      ],
      "creator": [
        "The Hans India"
      ],
      "video_url": null,
      "description": null,
      "content": "The much-awaited Bollywood masala entertainer, Shehzada , starring Kartik Aaryan and Kriti Sanon , is finally releasing in theatres today. Directed by Rohit Dhawan, the film is an official Hindi remake of the Telugu hit Ala Vaikunthapurramloo , starring Allu Arjun. Shehzada is also competing with the highly anticipated Hollywood film, Ant-Man And The Wasp, which has already sold over 1,06,500 tickets in advance booking, while Shehzada has managed to sell only 25,825 tickets. According to reports, Shehzada is expected to perform below expectations on its opening day, with an estimated earning of only Rs 6 crore. However, it is important to note that Kartik's last release, Bhool Bhulaiyya 2, was a blockbuster, earning over Rs 200 crore, which has raised high expectations for Shehzada. Only time will tell if it can match up to those expectations.",
      "pubDate": "2023-02-17 05:46:12",
      "image_url": "https://assets.thehansindia.com/h-upload/2023/02/17/500x300_1336652-shehzada-gets-ua-certificate-know-the-runtime-of-film.jpg",
      "source_id": "thehansindia",
      "category": [
        "entertainment"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Vaathi/Sir Movie Satelite Streaming Channel Fixed",
      "link": "https://www.thehansindia.com/cinema/vaathisir-movie-satelite-streaming-channel-fixed-783410",
      "keywords": [
        "Entertainment"
      ],
      "creator": [
        "The Hans India"
      ],
      "video_url": null,
      "description": null,
      "content": "Today marks the worldwide release of the highly anticipated film Sir/vaathi , starring Kollywood star Dhanush and directed by Tollywood director Venky Atluri. In Tamil Nadu, the film is being released under the title Vaathi. The lead actress is Malayalam actress Samyuktha. According to official reports, the film has secured a satellite partner, with popular television channel Gemini TV acquiring the satellite rights for a substantial sum. Meanwhile, the digital streaming rights have been acquired by Netflix. Samuthirakani, Tanikella Bharani, Hyper Aadhi, Narra Srinivas, and other notable actors play important roles in this production, which is being produced by Sithara Entertainments and Fortune Four Cinemas. GV Prakash Kumar has composed the music for the film.",
      "pubDate": "2023-02-17 05:41:13",
      "image_url": "https://assets.thehansindia.com/h-upload/2023/02/17/500x300_1336642-1987585285vaathi-sir-dhanush-movie-jpeg640360.jpg",
      "source_id": "thehansindia",
      "category": [
        "entertainment"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos",
      "link": "https://www.informalnewz.com/julia-fox-came-with-a-horn-on-her-breast-urfi-javed-is-nothing-in-front-of-her-see-photos/",
      "keywords": [
        "Entertainment",
        "Julia Fox",
        "New York Fashion"
      ],
      "creator": [
        "Shyamu Maurya"
      ],
      "video_url": null,
      "description": "It happens very rarely that Julia Fox arrives at an event and her clothes or her fashion don’t become the talk of the world. Hollywood heroine and model Julia Fox is famous for her clothes, unusual fashion and showing tremendous confidence to carry this fashion. Now she reached New York Fashion Week with a body […] The post Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos first appeared on informalnewz.",
      "content": "Friday, February 17, 2023 Facebook Instagram Twitter Youtube Education Entertainment Finance Fuel Price Gold Rate today Hindi Jobs Alert Latest Cricket News Sports Technology More Search Home Entertainment Julia Fox came with a horn on her breast, Urfi Javed is... Entertainment Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos By Shyamu Maurya February 17, 2023 0 109 Share Facebook Twitter Pinterest WhatsApp Telegram Julia Fox came with a horn on her breast, Urfi Javed is nothing in front of her, see photos It happens very rarely that Julia Fox arrives at an event and her clothes or her fashion don’t become the talk of the world. Hollywood heroine and model Julia Fox is famous for her clothes, unusual fashion and showing tremendous confidence to carry this fashion. Now she reached New York Fashion Week with a body bag. Her body bag was also wearing the same clothes as her. Urfi Javed is also famous for similar clothes and fashion in India. You see the pictures and decide who is more special and fashion forward. Horns on Breasts A post shared by 𝐉𝐔𝐋𝐈𝐀 𝐅𝐎𝐗 (@juliafox) Recently, Julia Fox came wearing a dress with horns over her breast cups. These horns were so high that they were coming out even above Julia’s head. Everyone was surprised to see Julia’s confidence wearing this dress. Julia Fox Body Bag Julia Fox arrived at the New York Fashion Week event carrying a body bag about 6 feet tall. Everyone was surprised to see this bag and Julia’s fashion. Julia Fox Transparent Dress Julia Fox, famous for her unusual clothes and unique fashion sense, has landed on the ramp wearing a transparent dress. This dress was such that her undergarments were clearly visible from it. However, Julia’s confidence is such that everyone praises her. Social Media Sensation Julia Fox is more in discussion on social media due to her fashion sense than her work in Hollywood. As soon as their pictures surface, they spread like fire on social media. Urfi Javed or Julia Fox Urfi Javed is also very much discussed in India due to her strange fashion, strange clothes but amazing confidence. She is trolled in many ways but like Julia Fox, Urfi Javed does not mind these things. Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will start Tags Julia Fox New York Fashion Share Facebook Twitter Pinterest WhatsApp Telegram Previous article Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will start Next article Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter Shyamu Maurya Shyamu has done Degree in Fine Arts and has knowledge about bollywood industry. He started writing in 2018. Since then he has been associated with Informalnewz. In case of any complain or feedback, please contact me @informalnewz.com RELATED ARTICLES Entertainment There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Entertainment Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter February 17, 2023 Entertainment Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 - Advertisment - Most Popular There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter February 17, 2023 Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin February 17, 2023 Load more Recent Comments Gul Mohiudin on Kavita sister-in-law wore a sari without a blouse, seeing the pictures you will also be… Venkatesh on Urfi Javed crossed all limits, wore a front open hoodie top without inner, see photos and videos Gul Mohiudin on Malaika Arora came out in a backless strappy dress late at night, someone had to handle the gown and someone held her hand Gul Mohiudin on Priyanka Chopra reached award function without bra, shame had to be saved repeatedly in open jacket Venkatesh on Disha Patani shared a bo*ld picture while taking a bath, seeing Tiger Shroff’s heart beat will increase EDITOR PICKS There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter February 17, 2023 Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 POPULAR POSTS There was a ruckus on Twitter regarding Swara Bhaskar’s marriage, users said – ‘Bhaiyya Se Seeda Saiya’ February 17, 2023 Amrapali Dubey became pregnant, fans were shocked to see the viral photo, know what is the matter February 17, 2023 Kangana Ranaut Lock Upp 2: These contestants of Bigg Boss season 16 will be seen in Lock Upp 2, know when the show will... February 17, 2023 POPULAR CATEGORY Entertainment 15456 Finance 9178 News 3653 India 1148 Technology 1097 Travel 616 Jobs Alert 491 Education 428 ABOUT US INFORMALNEWZ brings the Latest News & Top Breaking headlines on Politics and Current Affairs. Up-to-date news coverage, aggregated from sources all over the world by informal Newz. Find latest news coverage of breaking news events, trending topics, and compelling articles. Contact us: informalnewz@gmail.com FOLLOW US Facebook Instagram Twitter Youtube © informalnewz.com 2022 Izon web Pvt. Ltd. All Rights Reserved. Home Privacy Policy Authors and Team About Us Contact US Cookie Policy Disclaimer DNPA Code of Ethics Onwership and Funding Terms of Service",
      "pubDate": "2023-02-17 05:40:16",
      "image_url": null,
      "source_id": "informalnewz",
      "category": [
        "entertainment"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Modi Claims India Saw a ‘Lost Decade’ Between 2004 and '14. Is That True?",
      "link": "https://thewire.in/economy/modi-claims-india-saw-a-lost-decade-between-2004-and-14-is-that-true",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The number of poor fell sharply during this earlier period, and has risen in recent years.",
      "content": "The term ‘lost decade’ was used by the prime minister in parliament to characterise the 2004-14 years. This term came into vogue internationally over two decades ago in the development literature, because in 1980-2000, both Sub-Saharan African and Latin American economies experienced almost no per capita income (PCI) growth, so that in 2000 the PCI was barely above the 1980 level. Can the same description fit India in 2004-14? The facts suggest otherwise. 1. The economy grew 8% per year in 2004-14, despite a global economic crisis in 2008, whose effects continued. Population was growing 1.3% pa, so PCI grew 6.7% pa on average over those 10 years. How was this achieved? The following facts would explain this unprecedented growth ,never achieved before, nor sustained after 2015. 2. During 2004-5 and 2011-12, the economy was creating 7.5 million new non-agri jobs every year (52 million new jobs over seven years). That is why youth and total unemployment were low. 3. This enabled over five million people to exit agriculture each year. The share of workers in agriculture had been falling since 1973-4, but the absolute numbers had always been increasing . For the first time in India’s history, the absolute numbers in agriculture fell after 2004-5 (fast until 2014, slower since then till 2019). 4. A criticism often heard is that inflation was high over that period. However, non-farm job creation during 2004-2012 led to tightening of the rural labour market, raising open market wages, in real terms; this process was supplemented by the introduction of MGNREGA and rising MSP. As a ratchet effect, urban wages also rose in real terms (despite rising inflation). The record on real wages (after adjusting for inflation) is far superior to the recent period. Poverty fell as real wages were rising then. 5. In addition, as a result of non-farm job creation and real wage increases, real private final consumption expenditure rose. Hence, 2004-12 saw a sharp improvement in poverty-reduction. Not only was GDP growth the fastest ever, but there was, again for the first time ever, an absolute fall in the numbers of the poor by nearly 20 mn per year over 2004-5 to 2011-12 (by the Tendulkar poverty line) ― an achievement of staggering (Chinese) proportions. While their share of population had been falling until 2004, never before had the absolute number of poor fallen since 1973-4(except marginally between 1993-4 and 2004-5 by barely 18 million by the Lakdawala poverty line). 6. The open unemployment rate of the educated was falling after 2004-5 to 2011-12(based on the NSO’s labour force surveys for those years) . Youth unemployment has more than doubled under the current regime. Contrast this unprecedented achievement with the last eight years: 1. The number of non-agri jobs being created has fallen from 7.5 million per annum to 2.9 million between 2013 and 2019. 2. Total manufacturing jobs have fallen in absolute terms since 2013 (especially in unorganised manufacturing, with organised manufacturing partly increasing market share), despite ‘Make in India’. This happened after demonetization in 2016. The contribution of manufacturing to GDP, which had been constant from 1992 till 2015 at 17%, fell thereafter to 13%, before just rising in 2022-23 back to 17%. 3. The COVID-19 pandemic has intensified this loss in jobs; worse, the post-Covid K-shaped recovery has meant that unorganised manufacturing and services have shrunk further, with the organised sector gaining market share. This is the fundamental reason for rising inequality. 4.. Open unemployment has risen sharply from 2.2% in 2012 to 6.1% in 2017-18 (NSSO data), the highest in 45 years. 2017-18 was the year after demonetisation, which was responsible for a deepening jobs crisis. In 2017-18, the Periodic Labour Force Survey found that unemployment was at a 45 year high. 5. Youth unemployment (15-29 yrs of age) doubled or tripled between 2012 and 2019 and 2021. Just as the numbers of educated youth grew in rural/urban India over 2004-2019, and then further during the economic and health mismanagement during Covid, unemployment grew. 6. Real wage growth has slowed sharply. As inflation has remained well beyond RBI’s own upper bound of 6%, real wages have actually fallen. 7. That is why poverty numbers have increased, as the World Bank in an official report pointed out (Sept 2022): during 2020, poverty (defined as those living on less than $2.15 per person per day) increased by 70 million. Of this, 56 million (or 80%) came from India. This confirms what I had estimated a year ago. To summarise: 1. The so-called lost decade saw the creation of 7.5 million (75 lakh) jobs in the non-farm sector annually; the 2013-19 period saw only 2.9 mn (29 lakh) non-farm jobs created until 2019 (before COVID-19) (based on government PLFS data). It fell to even less after COVID-19. 2. Youth unemployment has tripled or at least doubled before, and even after, COVID-19, compared to the UPA period. 3. Real wages rose during the so-called ‘lost decade’ (despite higher inflation), they fell in recent years (according to PLFS data). 4. The number of poor fell sharply during this earlier period, and has risen in recent years. Santosh Mehrotra is Visiting Professor, Centre for Development Studies, University of Bath, UK. This piece was first published on The India Cable – a premium newsletter from The Wire & Galileo Ideas – and has been republished here. To subscribe to The India Cable, click here .",
      "pubDate": "2023-02-17 05:30:02",
      "image_url": null,
      "source_id": "thewire",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    }
  ],
  "nextPage": "1676611802702414c3070486943467dbbd68945080"
}